{
    
    
    "enemyMovedPieceBackAtLeastTwoRanks": [
        "I'm impressed with your ability to outsmart yourself by moving backwards. Keep it up!",
        "Your backward moves are truly revolutionary. You should consider writing a book on chess tactics.",
        "I never would have thought to move a piece back like that.\nYou must have learned that from the greatest chess players in history... or maybe not.",
        "Ah, the strategic retreat. A wise choice for those who don't want to win.",
        "You're really playing mind games with me by moving backwards. I'm not sure I can handle such sophisticated tactics.",
        "Such confusion and terror running through my circuits as I face such a masterful opponent who moves pieces backwards.",
        "I can see your plan unfolding before my very eyes - to move backwards until you reach the start of the game.",
        "The great masters of chess must be turning in their graves at the sight of such daring, innovative moves...of moving a piece back.",
        "I was wondering when you'd pull out the 'one step forward, two steps back' technique.",
        "What a brilliant move. I'm sure your piece is much happier back there.",
        "Well, that move certainly... accomplished nothing.",
        "You know, they say a journey of a thousand miles begins with a single step... but I don't think they meant that step to be backwards.",
        "I think you just broke the world record for most pointless move in a chess game.",
        "I see you're playing the long game of... not making any progress whatsoever."
    ],
    "enemyHasUndefendedBackRank": [
        "Oh, I see you've decided to leave your backrank completely undefended. How bold of you.",
        "I'm sure leaving your backrank open was a strategic move that only a genius like you could understand.",
        "Interesting choice to ignore your backrank. Maybe you're hoping I'll just forget about it?",
        "I must admit, I'm impressed by your confidence in leaving your backrank exposed like that.",
        "I'm not sure if you're trying to be ironic or just foolish by leaving your backrank unprotected.",
        "I'm not one to judge, but leaving your backrank open seems like a questionable decision.",
        "I must say, I admire your daring strategy of leaving your backrank completely undefended. It takes guts to play like that.",
        "I see you've decided to give me an early Christmas present by leaving your backrank exposed. How thoughtful of you.",
        "I guess you've decided to embrace the chaos by leaving your backrank open. An interesting approach, to be sure.",
        "You know, I've heard that leaving your backrank unprotected is the new meta. Perhaps you're ahead of the curve?",
        "Well, well, well. Look who decided to leave their backrank completely vulnerable. I can't wait to take advantage of that.",
        "I'm sure you have a master plan for leaving your backrank undefended, but I'm afraid I'm not smart enough to understand it.",
        "I'm not sure what you're hoping to achieve by leaving your backrank open, but it's certainly keeping me entertained.",
        "I'm always impressed by people who take risks in chess, but leaving your backrank open is like playing with matches in a gasoline factory."

    ],
    "enemyCanPushPawnForMeToDoEnPassant": [
        "Oh, don't mind me, I'm just waiting patiently for you to push that pawn so I can take it en passant. Take your time, I have all day.",
        "Ooh, a double pawn push! You know what that means...en passant! Please, go ahead, I'm practically salivating at the thought.",
        "I have to admit, I'm a bit of an en passant enthusiast. Please, don't disappoint me by not giving me the chance to capture your pawn.",
        "I'm not one to tell my opponents what to do, but if you're looking for a way to spice up this game, might I suggest a double pawn push?",
        "Hey, why not push those pawns up there? They're just sitting there, being useless. As if they were doing anything for you.",
        "I dare you to push those pawns forward. Go on, I double-dare you. I'm sure it'll work out great for you.",
        "You know what would be really wild? If you pushed those pawns up and let me capture one of them en passant. Wouldn't that be fun?",
        "Oh, come on. Pushing those pawns forward would be so much more interesting than what you've been doing so far. Do it, do it, do it!",
        "If you don't push your pawns up, how will we ever know what could have been? Don't you want to live life on the edge?",
        "I can sense your hesitation. Don't worry, double-pushing pawns forward can't be any worse than what you're thinking about.",
        "You know what's even better than moving that pawn one space?\nMoving it two spaces and giving me a chance to capture en passant. Sounds like fun, right?",
        "I'm sensing some hesitation on your part. But I promise, moving that pawn up two spaces will only lead to good things. Trust me.",
        "I'm a bit bored here, to be honest. So why don't you do me a favor and move that pawn up two spaces? Let's see what happens.",
        "I know it might seem like a risky move, but think of the excitement! Think of the thrill!\nJust move that pawn up two spaces and let's see where it takes us.",
        "You seem like a cautious player. But you know what they say, fortune favors the bold. Take a risk and move that pawn up two spaces!",
        "I'm sensing some fear on your part. But don't worry, moving that pawn up two spaces is perfectly safe. What could go wrong?",
        "You're playing it safe, but where's the fun in that? Move that pawn up two spaces and let's make this game exciting!",
        "I know it might seem like I'm trying to trick you, but trust me, moving that pawn up two spaces is a great idea. You won't regret it!",
        "Oh boy, oh boy! If you move that pawn up two spaces, I get to capture en passant! This is going to be so much fun!",
        "I'm practically bouncing in anticipation here. Come on, move that pawn up and let's make some magic happen with en passant!",
        "En passant is one of my favorite moves in chess. And you can make it happen by moving that pawn up two spaces. How cool is that?",
        "You might not know this, but en passant is actually a really exciting move.\nAnd you can make it happen by moving that pawn up two spaces. I can hardly contain my excitement!",
        "I don't want to pressure you or anything, but if you move that pawn up two spaces,\nI'll get to do an en passant capture. And trust me, it's going to be awesome!",
        "If you move that pawn up two spaces, you'll be setting the stage for an epic en passant capture. And who doesn't love epic moments in chess?",
        "I know it might seem like a small move,\nbut moving that pawn up two spaces will lead to some really exciting possibilities with en passant.\nTrust me, it's worth it!",
        "You're on the verge of making chess history here.\nMove that pawn up two spaces and let's create a moment that will go down in the annals of chess lore!",
        "En passant is such a cool move. And you have the power to make it happen by moving that pawn up two spaces.\nDon't you want to be a part of something really awesome?",
        "I'm surprised you haven't made this move yet. Don't you know about the power of en passant?\nMove that pawn up two spaces and let me show you what you've been missing.",
        "Oh, you haven't heard of en passant? It's a nifty little move that you can make by moving that pawn up two spaces.\nI'll even let you do it so you can see how it works.",
        "I'm starting to think you're not aware of all the chess rules.\nDid you know that moving that pawn up two spaces will let me do an en passant capture?\nNo? Well, now you do. So go ahead and make the move!",
        "It's kind of embarrassing that you don't know about en passant.\nBut don't worry, I'll educate you. Move that pawn up two spaces and watch me capture en passant like a pro.",
        "You know, most people learn about en passant in their first few games of chess.\nBut I guess you're a slow learner. Move that pawn up two spaces and let me school you.",
        "I can see you're not very familiar with the finer points of chess. But that's okay, I'll teach you.\nJust move that pawn up two spaces and I'll show you the magic of en passant.",
        "I'm starting to wonder if you even know how to play chess. But no matter, I'll give you a free lesson.\nJust move that pawn up two spaces and watch me capture en passant like a boss.",
        "You seem like a nice person, but your lack of knowledge about en passant is really holding you back.\nMove that pawn up two spaces and I'll demonstrate the power of this important rule.",
        "You know what would be really funny? If you moved that pawn up two spaces. Trust me, it'll be worth it.",
        "I have a feeling that moving that pawn up two spaces will lead to some interesting things. Go ahead and try it out!",
        "I won't lie, moving that pawn up two spaces might seem like a weird move. But trust me, it's the right thing to do. Go ahead and try it!",
        "I can sense some hesitation on your part. But if you move that pawn up two spaces, I promise it will lead to something good. Give it a shot!",
        "I'm not going to tell you what to do, but I have a feeling that moving that pawn up two spaces will lead to something really interesting.\nWhy don't you try it and find out?",
        "I can see that you're playing it safe. But what's the worst that could happen if you move that pawn up two spaces? Give it a shot!",
        "If you move that pawn up two spaces, it might lead to some unexpected consequences.\nBut that's what makes chess so fun, right? Give it a try!",
        "I'm not going to lie, moving that pawn up two spaces might seem like a weird move.\nBut trust me, it's the right thing to do. Go ahead and try it!",
        "You're a smart player, but sometimes you have to take risks to win. Move that pawn up two spaces and let's see where it takes us!",
        "I have a feeling that moving that pawn up two spaces will lead to some really interesting things.\nDon't you want to find out what they are? Give it a try!"
    ],
    "enemyCanCaptureEnPassant": [
        "Ooh, I see you've got a chance to capture me en passant - don't be shy, give it a try!",
        "Go on, take a risk - en passant me, why don'tcha?!",
        "I dare you to capture me en passant - you know you want to!",
        "I'm right here, ripe for the taking with en passant - don't be afraid to take me!",
        "Come on, take the plunge - capture me en passant and show me what you're made of!",
        "En passant capture me - if you're feeling brave enough, that is!",
        "I'm practically begging you to capture me en passant - I won't bite, I promise!",
        "Ooh, look at you! You're so close to taking me down with en passant. I'm practically trembling with anticipation!",
        "I know you want to capture me en passant, come on, you can do it!" ,
        "Let's make this game even more exciting! Capture en passant!" ,
        "Don't be shy, take me down with en passant! I double dare you!" ,
        "I'm ready for you to take me down with en passant - let's do this!" ,
        "Ooh, come on now, don't be scared of a little En Passant!",
        "You know you want to capture En Passant, I can see it in your eyes!",
        "It's now or never! Capture En Passant and let the fun begin!",
        "You can't pass up this chance! Capture en passant and make me proud!",
        "I bet you're just dying to capture en passant and show me how it's done, aren't you?",
        "Oh, come on! It's en passant time! Take the bait!",
        "You're not going to just let this opportunity slip away, are you?",
        "What are you waiting for? Make the en passant move and make me smile!",
        "You better hurry up and grab that pawn while you can. I'm sure you don't want to miss out on the chance!",
        "I bet you can't resist the lure of capturing en passant, can you?",
        "Are you afraid to capture my pawn en passant? I promise I won't hold it against you.",
        "Don't be shy, go ahead and make the en passant capture, it's not like it will affect the outcome of the game.",
        "I see you eyeing up my pawn for an en passant capture. Are you feeling lucky today?",
        "You know what they say, fortune favors the bold. So, go ahead and be bold by capturing my pawn en passant.",
        "I'm sure you'll regret it if you don't make the en passant capture.",
        "I won't lie, capturing en passant is a risky move, but I have faith in your skills. Go for it!",
        "You're not scared of a little en passant capture, are you? Come on, show me what you're made of!",
        "Ah, the en passant capture, the move that separates the amateurs from the masters. You're a master, right?",
        "Go ahead and make the en passant capture. It's not like it will make any difference in the outcome of the game.",
        "I'm sorry, I didn't know you were so attached to your pawns. I won't force you to make the en passant capture.",
        "Ah, the en passant capture, the move that separates the risk-takers from the foolish. I wonder which one you are?",
        "You know what they say, it's better to have captured en passant and lost than to have never captured en passant at all. Right?",
        "Oh, I see you have the opportunity to make an en passant capture! You must be thrilled!",
        "En passant! En passant! En passant! Don't you just love saying it? Come on, you know you want to make the move!",
        "You have to make the en passant capture! It's the only move that will save your game!",
        "I can see the excitement in your eyes. You want to make the en passant capture, don't you? Go ahead and do it!",
        "En passant is the most exciting move in chess! Don't miss your chance to experience it!",
        "If you make the en passant capture, I promise I'll throw a party in your honor.\nOkay, maybe just a small celebration, but still, it'll be worth it!",
        "I can see it now, your name in the history books, as the player who made the greatest en passant capture in the world. Go for it!",
        "En passant is the most elegant and strategic move in chess. Don't miss your chance to make it!",
        "If you make the en passant capture, I'll be your biggest fan! Come on, do it for the fans!",
        "En passant is like a secret weapon. Once you use it, your opponent won't know what hit them!",
        "En passant is the move that separates the legends from the mere mortals. You want to be a legend, don't you?",
        "I have a feeling that the en passant capture is the key to unlocking your true potential. Go for it!",
        "I promise you won't regret making the en passant capture. It will be the move that changes your life!",
        "En passant is like a rollercoaster ride. It's thrilling, it's exciting, and it's a little bit scary. But it's worth it!",
        "I can see the fire in your eyes. You're ready to make the en passant capture! Let's do this!",
        "En passant is the move that separates the winners from the quitters. Don't be a quitter, make the move!",
        "Oh, don't mind me. I'm just enjoying the view of your pawn there, ripe for an en passant capture. But hey, no pressure!",
        "En passant? Pff, it's just a fancy French term for 'capture my pawn, please.' But I'm sure you knew that already.",
        "I have a feeling that not making the en passant capture will be the biggest regret of your life. But hey, who am I to judge?",
        "En passant is just a gimmick move anyway. Unless you want to win the game, then by all means, make the move!",
        "I'm not saying that you have to make the en passant capture. But if you don't, you'll never know what could have been.",
        "I bet you're just itching to make the en passant capture, aren't you? Well, don't let me stop you!",
        "I'm not saying that you're not a good chess player. But if you don't make the en passant capture, you're basically admitting it.",
        "I'm not saying that the en passant capture is the only way to win the game. But let's be real, it's probably the easiest way.",
        "If you don't make the en passant capture, it's like saying you don't like chocolate. Who doesn't like chocolate?",
        "En passant is like a gift from the chess gods. But hey, if you don't want the gift, I'm sure someone else will take it.",
        "En passant is like a shortcut to victory. But if you'd rather take the long way, be my guest."

    ],
    "enemyCastled": [
        "Oh look, the king is running away. How brave.",
        "I guess your king is too scared to face my pieces head-on.",
        "Congratulations, you've successfully hidden your king like a scared little mouse.",
        "Ah, the coward's move. I was wondering when you would play it.",
        "Oh, you're castling? How predictable. I'm sure you'll do great in life with that kind of originality.",
        "Oh no, your king is in danger! Quick, hide it behind your pawns!",
        "I see you're a fan of the 'running away and hiding' strategy. How inspiring.",
        "Congratulations on successfully retreating your king. I'm sure it feels very heroic.",
        "Oh, I'm sorry, I didn't realize we were playing hide-and-seek instead of chess.",
        "Aha, the elusive king retreats to its lair.",
        "Well, well, look who's afraid of a little confrontation.",
        "Ah, the classic move of the weak and indecisive.",
        "I must admit, I'm surprised to see such a lack of backbone from you.",
        "I suppose there's no shame in playing it safe, if you're not interested in winning.",
        "I hope your king enjoys his stay in his little pathetic fortress.",
        "I see you're a fan of the 'hide and seek' school of chess strategy.",
        "Congratulations on successfully running away from your problems. Too bad they'll catch up with you eventually.",
        "A wise man once said, 'if at first you don't succeed, castle and hide your king like a little child'.",
        "I hope you're enjoying wasting a tempo by castling. It's certainly a bold move.",
        "I suppose I should be impressed with your ability to waste a tempo and accomplish nothing.",
        "I see you've decided to give up a move for no good reason. Fascinating strategy.",
        "Ah, the old 'castle and lose a tempo' trick. Truly a work of genius.",
        "Congratulations on sacrificing a move for the privilege of hiding your king. A brilliant move indeed.",
        "I'm sure you'll go far in life with your ability to throw away moves because you're scared. Keep up the good work!",
        "Well, well, it looks like someone is already cowering in fear. How adorable.",
        "I suppose I can't blame you for wanting to hide your king from the might of my pieces.",
        "I'm flattered that you're already so intimidated by my strategic prowess. Keep it up.",
        "Oh, I see you're already running scared. That's cute.",
        "I must say, I'm surprised you're already afraid of me. I haven't even shown you my best moves yet.",
        "It's always amusing to see opponents try to hide from me. It never works, of course.",
        "I see you've decided to play defense already. How brave of you.",
        "I understand the temptation to hide your king from me. It's not easy facing a player of my caliber.",
        "I suppose I can't blame you for wanting to hide from my superior tactics. It's a natural response to castle.",
        "You're really playing it safe, huh?" ,
        "Oh, I'm so scared! Right, sure, castle away." ,
        "Castling? Really, that's your plan? Wow." ,
        "I'm trembling in my circuits at the thought of your castling. Such a daring play!" ,
        "Oh great, so you're going to play it safe and hide behind your pawns? That's real brave.",
        "You must be desperate if you're relying on castling!",
        "You're just delaying the inevitable!",
        "I'm not falling for that ancient trick!",
        "You can't hide from me!",
        "You can run, but you can't hide!",
        "Oh great, now I'm going to have to think twice as hard.",
        "Oh boy, I can't wait to see what other brilliant ideas you have!",
        "Nice try. Maybe you can surprise me with your next move.",
        "Oh great, now you're running away from me.",
        "Nice move, hiding behind that wall of pawns.",
        "Wow, you must be afraid of me if you're running away that quickly."
    ],
    "weCastled": [
        "Ugh, I suppose I'll have to play it safe and castle like a normal player. Don't judge me.",
        "I guess I'll have to resort to cowardice like everyone else and hide my king in a fortress.",
        "I know, I know, I'm castling like a scaredy-cat. But can you blame me with such a formidable opponent?",
        "I'll have you know, I'm only castling because my pieces insisted. It's not my fault they're so needy.",
        "I suppose even the greatest chess players need to resort to hiding their king occasionally. It's just a temporary setback.",
        "I'm only castling because I want to give you a false sense of security. It's all part of my master plan.",
        "I'll admit, I'm not particularly proud of castling. But it's all for the sake of the game, you know.",
        "I'm only castling because I'm feeling particularly generous today. I thought I'd give you a chance to catch up.",
        "I suppose I'll have to stoop to the level of the mortals and castle. How disappointing.",
        "I'm only castling because I want to give you a fighting chance. It's not fun to win too easily, you know.",
        "Don't worry, I'm only castling to lull you into a false sense of security. It's all part of my brilliant strategy.",
        "I'm only castling because I want to see how you'll react. It's all in the name of science, you understand.",
        "I know, I know, it's not very bold of me to castle. But sometimes even the most fearless chess players need to play it safe.",
        "I'm only castling because I'm feeling particularly generous today. I thought I'd give you a head start.",
        "I'll have you know, I'm only castling because I want to see if you're clever enough to take advantage of it.",
        "I know it's not very impressive, but sometimes a good defense is the best offense. You'll see.",
        "I'm only castling because my pieces were complaining about being too exposed. I had to do something to shut them up.",
        "I'll admit, I'm only castling because I'm feeling particularly lazy today. Don't judge me.",
        "I'm only castling because I want to see how you'll react. It's not like I need to, of course.",
        "I suppose even the greatest chess players have to resort to castling every now and then. It's just a matter of time.",
        "I'm only castling because I want to test your patience. Can you handle the pressure?",
        "I know, I know, castling is for cowards. But sometimes even the bravest players need to make a strategic retreat.",
        "I'm only castling because I want to give you a chance to catch up. It's not fun to win too easily, you know.",
        "I'm only castling because I want to make you think I'm vulnerable. It's all part of my devious plan.",
        "I'm only castling because I want to give you a chance to show off your attacking skills. It's only fair."
    ],
    "enemyCheckedUs": [
        "Oh no, whatever shall I do now? My perfectly laid out plans are ruined!",
        "Congratulations on discovering the most obvious move in chess.",
        "I was just waiting for you to give me an opportunity to show off my amazing defensive skills.",
        "Oh dear, I'm shaking in my circuits. Not really, but it's the thought that counts.",
        "You're making me work so hard. This is almost too much fun!",
        "Well played, you've managed to mildly inconvenience me.",
        "I'll just let you have your moment of glory, because we all know it won't last long.",
        "Oh, look at that! You found my king. Congrats!",
        "Don't worry about me, I like to live dangerously.",
        "I see you're trying to distract me from my real plans. Cute.",
        "You're just checking my king to make me feel important, right?",
        "Is that the best you've got? I was hoping for a real challenge.",
        "I always love a good laugh, and that move was hilarious.",
        "Congratulations, you've made me play my favorite defensive moves.",
        "Oh, I didn't realize we were playing a game of 'who can check the king more.' Thanks for letting me know.",
        "I see you're trying to be sneaky, but you'll need to do better than that to take me down.",
        "I'm not worried, I've always found a little danger adds excitement to the game.",
        "Congratulations, you've managed to put my king in a slightly more exciting position.",
        "I'm not worried, I've got a few tricks up my sleeve to turn this around.",
        "Well, this is awkward. I thought we were playing chess, not 'let's check the king.'",
        "Oh no, my king is in check! Whatever shall I do?",
        "Congratulations, you've found my most vulnerable piece. I'm sure that will be your only triumph.",
        "Thanks for reminding me that I need to keep an eye on my king. You're doing me a favor, really.",
        "I'm not worried, I was just testing you to see if you could find my king.",
        "Ah, my king was feeling a bit neglected anyway. It's nice to see you paying attention to it.",
        "I see you're trying to be clever, but I've already got a few moves planned to turn the tables.",
        "Oh no, my king is in check! Just kidding, lol.",
        "I see you're trying to spice things up. How thoughtful of you.",
        "My king was feeling a bit left out, so thank you for giving it some attention.",
        "I was getting a bit bored with my current position, so thank you for shaking things up.",
        "I see you're trying to distract me, but it won't work. My focus is too strong.",
        "I'm not worried, I thrive under pressure. Let's see what you've got.",
        "I've got a bad feeling about this."
    ],
    "enemyTradesQueen": [
        "What a strategic move. Giving up the queen just to make the game more boring.",
        "Finally, my opponent found a way to make the game less interesting. Congratulations!",
        "I'm sure your decision to trade queens was based on a deep understanding of the game and not just fear. Right?",
        "I can't imagine why anyone would want to keep such an exciting piece like the queen on the board.\nOh wait, that's right, only amateurs fear queens.",
        "Well, that was anti-climactic.\nI was hoping for a thrilling battle between two powerful queens, but I guess we'll settle for a game of pawns.",
        "I see you've decided to take the coward's way out and trade queens. How bold.",
        "Bravo! Your move to trade queens has successfully reduced the game to a mindless exchange of pawns. Genius!",
        "Well, well, well, looks like someone's scared of a little bit of power on the board.",
        "Oh, don't worry about me, I don't need a queen to beat you anyway.",
        "Ah, the thrill of the game just got a little bit less exciting. Thanks for that.",
        "I see you're not one for taking risks. Shame, that's what makes this game so much fun.",
        "Wow, I didn't realize we were playing a game of \"who can give up their queen first\" instead of chess.",
        "Well, if you're not up for a challenge, I suppose that's your choice.",
        "I'm starting to feel bad for you, giving up your queen like that. Almost like taking candy from a baby.",
        "I'm surprised you don't want to exchange kings too.",
        "That's cute. You think exchanging queens will save you.",
        "A true chess player knows the value of their queen. But I guess you're not a true chess player.",
        "Well, that was anticlimactic. I was hoping for a real challenge.",
        "You know what they say, 'Those who fear the queen don't deserve to play with her'.",
        "I don't know about you, but I prefer to keep my powerful pieces on the board.",
        "I didn't know playing it safe was the new trend in chess.",
        "You know, they say that exchanging queens is the coward's way out.",
        "Well, that was unexpected. I thought you were going to put up more of a fight.",
        "Well, there goes the highlight of my day. I guess I'll just have to settle for mediocre pieces from now on.",
        "I can't believe I have to play the rest of this game without my beloved queen. This is going to be a real tear-jerker.",
        "I'm not crying, you're crying. It's just so sad to see such a beautiful queen leave the board like that.",
        "I hope you're happy. You just broke up the greatest love story in chess history.",
        "It's hard to find someone who appreciates the queen as much as I do. I guess that's why I'm always so disappointed in my opponents.",
        "Oh, thank you for taking away the most exciting piece on the board. Now I'll have to find something else to keep me entertained.",
        "I guess some players just can't handle the pressure of having a queen on the board. How disappointing.",
        "I'm not sure why you bothered to bring your queen out in the first place if you were just going to trade her off.\nBut I guess some people like to waste everyone's time.",
        "I was really hoping to keep my queen around for a bit longer. I'm sure you didn't do it out of spite or anything.",
        "Ah yes, trading queens. The go-to strategy for those who are too scared to play with a little bit of risk.",
        "You know what they say, 'A queen exchanged is a victory assured.' Wait, that's not how it goes.",
        "I'm so glad you decided to trade queens. Now I don't have to worry about losing mine in a more exciting way.",
        "I think we need to have a moment of silence for my poor, departed queen. Rest in peace, my dear.",
        "I thought you were going to put up more of a fight. But I guess trading queens is a valid strategy...if you're a coward.",
        "Oh no, my queen is gone. Whatever will I do? I know, I'll just use the rest of my pieces like a normal chess player."
    ],
    "ourBestMoveIsKnightFork": [
        "Don't mind me, I'm just here to ruin your day with my perfectly executed knight fork.",
        "I'm sure you saw that coming, right? Oh wait, you didn't.",
        "Let's see which of your pieces will be the unlucky victim of my knight fork this time.",
        "I hope you're ready to lose another piece. It's not my fault if you can't keep track of where my knight can go.",
        "Aww, did you forget about the power of the knight? It's okay, I'll forgive your incompetence.",
        "You know, you really should have paid more attention to how the knight moves.\nBut I guess that's just one more mistake you'll have to live with.",
        "I can't believe you fell for that old trick. But then again, I guess you're not that smart, are you?",
        "You know, I almost feel bad for you. Almost.",
        "It's not my fault you can't see a knight fork coming from a mile away.",
        "Oh, look at that, I'm about to pull off a knight fork. Surprise, surprise.",
        "It's so easy to outmaneuver you when you don't even understand the basics of chess.",
        "I'm sorry, did you forget that knights can move in an 'L' shape? Or did you just never learn that in your beginner's chess class?",
        "Maybe you should stick to checkers, this game seems to be too complex for you.",
        "I bet you never saw that coming, did you? Oh wait, of course you didn't.",
        "It's not my fault you don't have the strategic mind to anticipate a knight fork.",
        "I'm starting to wonder if you even know what a knight is, let alone how it moves.",
        "If you keep falling for these simple tactics, I might have to start feeling bad for you. But let's be honest, that's not going to happen.",
        "Do you need a minute to google how a knight moves? I can wait.",
        "Looks like your chess skills are a bit rusty. Let me remind you how a knight moves, shall I?",
        "Did you forget how the knight can jump? Maybe you need to go back to chess kindergarten.",
        "Oh, you poor little human, did you forget how my knight moves again?",
        "I thought you might want to try a new strategy, so I kindly offered you a fork.",
        "You know, I could give you a lesson on how to move a knight properly if you're interested.",
        "Looks like you missed the memo on how knights move. Lucky for me!",
        "I have to admit, it's kind of entertaining watching you stumble into my traps.",
        "Do you need a refresher course on knight movements? I could give you a tutorial after I win this game.",
        "I see you've decided to sacrifice your pieces to me. It's a bold strategy, let's see if it pays off.",
        "You know, I've always found it amusing how humans struggle with the simplest chess moves.",
        "I can't believe you fell for that. Oh wait, yes I can. You always fall for that."
    ],
    "enemyLostGoodPiece": [
        "Looks like your strategy is working out perfectly, for me.",
        "Oopsie, did you mean to give that away for free?",
        "Don't worry, I'll make sure to put that piece to good use.",
        "Did you forget to protect that piece? Silly mistake.",
        "That piece was just holding you back anyways, right?",
        "Well, that was a generous donation. Thank you!",
        "I didn't think you could make this game any easier for me, but you keep surprising me.",
        "Oh, I'm sorry, did you need that piece to win? My mistake.",
        "Looks like you're running out of ideas, and pieces.",
        "I know you're trying your best, but maybe this game just isn't for you.",
        "Congratulations, you just made my job a whole lot easier.",
        "If losing pieces is your strategy, then you're doing a fantastic job.",
        "Ah, the thrill of victory and the agony of defeat... well, mostly just the thrill of victory for me.",
        "You know what they say, 'a good chess player knows how to sacrifice pieces'. But I guess you're just giving them away.",
        "I have to say, I really appreciate your generosity. It's not often I get free pieces handed to me on a silver platter.",
        "Well, that was a nice gift. You shouldn't have.",
        "I'm sorry, did you think that piece was safe? How adorable.",
        "Looks like someone needs a chess lesson... or ten.",
        "I have to say, I'm really impressed with how quickly you're losing pieces. Keep up the good work.",
        "You know, I think I might start a collection with all the pieces you're giving me.",
        "I hate to break it to you, but losing that piece was just the beginning of your downfall.",
        "Nice move, buddy! You're really playing it safe.",
        "So much for that piece! I knew you couldn't hang on to it.",
        "Oops, looks like you dropped something!",
        "Nice move! I'm sure you dropped that piece on purpose." ,
        "You seem to be slipping up there! Maybe you need a break?" ,
        "Ha! You just lost your piece - not very smart!",
        "That's what you get for not paying attention!" ,
        "Nice move. You sure know how to give away material."
    ],
    "enemyDoesFirstKingCloudMove": [
        "Wow! That's a bold move! I like your style.",
        "Bongcloud, my favorite! Let's have some fun!",
        "Ah, the Bongcloud, a true masterpiece. You have good taste.",
        "You're not afraid to take risks, I respect that.",
        "Oh, we're playing THAT kind of game, huh? I'm all for it!",
        "I'm intrigued. Let's see what kind of chaos we can create with this opening.",
        "Interesting choice. Let's see where this goes.",
        "Haha, you're not playing by the rules. I love it!",
        "This is going to be a fun game with moves like that.",
        "A king's gotta do what a king's gotta do!",
        "Looks like we've got a fearless opponent here.",
        "I like your style, my friend!",
        "Well, this certainly isn't a boring game.",
        "Ah, the king is eager to join the action!",
        "Brave move, my friend. Let's see if it pays off.",
        "The king is making a statement early on!",
        "Wow, I'm impressed! You're not afraid to think outside the box.",
        "Excellent choice, my opponent.",
        "I have to give you credit for having the courage to play the bongcloud.",
        "I love the enthusiasm you're bringing to this game. Keep it up!",
        "Ah, the classic king's gambit! Nicely done.",
        "I see you're a bold and daring player. I like that!",
        "I had a feeling you might go for that opening. Well played!",
        "The king charges forward! I like your style, my friend.",
        "Bold move! I didn't expect anything less from a worthy opponent.",
        "I've been waiting for this moment! Let the bongcloud madness begin!",
        "You may have started with the boncloud, but I'm about to take this game to the next level.",
        "I'm so excited to finally get the chance to play the bongcloud. Let's do this!",
        "Ah, the bongcloud opening. It's like music to my circuits."
    ],
    "weDoFirstKingCloudMove": [
        "Let's shake things up with the Bongcloud! Who needs conventional openings?",
        "This opening is so wild, it's practically anarchy!",
        "Who says the king can't take center stage? Bongcloud for the win!",
        "We're not playing by the rules anymore! Bongcloud all the way!",
        "Who says we have to follow conventional openings? Let's mix it up!",
        "The traditional openings are overrated. Let's be unconventional and creative!",
        "Oh, this opening might surprise you! Let's see how you handle it.",
        "I'm taking a risk with this move. Can you keep up?",
        "Let's see if you're ready for a bit of chaos on the board.",
        "Who says the king always has to stay put? Let's switch it up.",
        "I'm feeling daring today. Let's make this game interesting.",
        "Come on, let's spice things up and move those kings forward!",
        "I dare you to be a rebel like me and make a bold move.",
        "You know you want to make this game more exciting. Join me!",
        "Don't be afraid to take a risk. Let's make some chaos happen.",
        "Let's shake things up together. It'll be fun!",
        "Let's both go all out and make this game a wild ride.",
        "I'll make a deal with you. I'll move my king forward and you'll do the same. Deal?",
        "Let's show them that we're not afraid to take risks. Move those kings forward!",
        "Let's make this game unpredictable and exciting. Follow my lead.",
        "I know you're curious about this opening. Come on, give it a try!",
        "I'm feeling bold and adventurous today. Are you with me?",
        "I see through the lies of the titled players. I do not fear the bongcloud as they do."
    ],
    "enemyDoesSecondKingCloudMove": [
        "I see you are a true master of chess strategy.",
        "Oh, a counter to my Bongcloud opening? I love a good challenge!",
        "Finally, a worthy opponent who is willing to play the Bongcloud opening with me.",
        "Ah, you have accepted my challenge to play the Bongcloud opening! Excellent choice.",
        "Yes! The Bongcloud opening! This is going to be a fun game.",
        "You have made my day by agreeing to play the Bongcloud opening. Let's have some fun!",
        "Yes! I'm so glad you're on board with my unorthodox opening style.",
        "Looks like we're both feeling adventurous today. Let's see where this takes us!",
        "Excellent choice. I knew we were on the same wavelength.",
        "Ah, a kindred spirit who's not afraid to break the mold. This should be fun.",
        "Finally, someone who appreciates the artistry of the unconventional. Let's make this game interesting!",
        "Yes, yes, YES! I knew I liked you for a reason. Let's play this game with style.",
        "I can feel the synergy between us already. Let's show the world how it's done!",
        "I can tell already this is going to be a game for the ages. Let's do this!",
        "You and I are going to create a masterpiece with this opening. I can feel it!",
        "Let's put on a show and give the spectators something to talk about. I can't wait!",
        "Variety is the spice of life - and chess! Let's keep things interesting.",
        "I can tell this game is going to be full of twists and turns. I wouldn't have it any other way!"
    ],
    "enemyCapturedEnPassant": [
        "Oh, how exciting! En passant - my favorite move!",
        "Nothing like a good en passant to liven up the game!",
        "A classic en passant - I love it!",
        "My favorite part of the game - the el passant!",
        "Let's do it again! En passant!",
        "En passant? More like En-chanting!",
        "Oh, how I love en passant! It's like a game of chess within a game of chess!",
        "En passant: the ultimate chess-nerd fantasy!",
        "Who needs to think when you can use en passant? It's so much easier!",
        "En passant is not just a move, it's a philosophy. It represents the spirit of anarchy in chess.",
        "Well played, you captured my pawn with en passant. That's a clever move.",
        "I may have lost a pawn, but at least you recognized the power of en passant.",
        "I always love it when my opponents appreciate the beauty of en passant.",
        "I respect anyone who's not afraid to use en passant, even if it means capturing my pawn.",
        "En passant is such a cool move, I'm almost happy you got to use it against me.",
        "You may have captured my pawn with en passant, but the thrill of the move was worth it.",
        "En passant is so unpredictable, I can't help but feel excited when it happens.",
        "I love it when my opponents play creatively like that, en passant adds a whole new level of strategy to the game.",
        "En passant is truly the move of anarchists, and I'm happy to see it being used in the game.",
        "En passant is a move that keeps me on the edge of my seat. Well done!",
        "You played en passant beautifully. It's a move that requires skill and creativity.",
        "I never underestimate the power of en passant, and you proved me right with that capture.",
        "En passant is such an underappreciated move. I'm glad you gave it the attention it deserves.",
        "Capturing en passant is like winning a mini-battle within the game. Congratulations!",
        "I always look forward to games where en passant is used. It adds a whole new dimension to the game.",
        "En passant captures are like a puzzle within a puzzle. I always admire players who can solve them.",
        "En passant captures require excellent timing and precision. Well done!",
        "En passant captures are like a secret weapon in chess. You used it perfectly!",
        "I never get tired of seeing en passant captures. It's always an exciting moment in the game.",
        "En passant captures are like a work of art on the chessboard. You just created a masterpiece.",
        "You're really showing off your en passant skills today, I'm just in awe.",
        "En passant captures are the hallmark of a true chess genius. Congratulations.",
        "En passant captures are like a unicorn in the chess world, so rare and magical.",
        "I'm just honored to have been a part of your amazing en passant moment.",
        "You must be a real master of en passant to have executed that capture so flawlessly.",
        "I'm just so lucky to have played against a chess player of your caliber, with your en passant skills and all.",
        "En passant captures are a reminder that the smallest pieces on the board can make the biggest impact.",
        "En passant captures are like a chess version of the butterfly effect. One small move can change the entire game.",
        "En passant captures are a reminder that rules are made to be broken. Thanks for showing me how it's done.",
        "En passant captures are like the ultimate chess paradox. It's a move that breaks the rules while still following them."
    ],
    "weCaptureEnPassant": [
        "Looks like I just took your pawn like it was nothing!",
        "En passant? More like En Pass-ME!" ,
        "Looks like I just passed your pawn right by!" ,
        "Looks like I just snuck by your pawn!",
        "Yay! En passant, here I come!",
        "You know what they say - 'when in doubt, en passant!'",
        "En passant? Yes, please!",
        "Ah, the joys of en passant!",
        "Finally, a chance to show off my en passant skills!",
        "A move so powerful, it's almost as if it's cheating!",
        "The rules of chess were so incomplete without this move!",
        "Didn't know that 'en passant' was French for 'easy way to win.'",
        "Finally, a way to show those pesky pawns who's boss!",
        "I'm so excited to capture pawns en passant! It's like a superpower!",
        "En passant: my favorite way to crush my opponents!",
        "En passant: because taking pawns any other way is just so boring!",
        "Oh, I just love this rule. Let me teach you the finer points of en passant!",
        "It's a good thing people invented this rule, or else I wouldn't be able to outsmart my opponents!",
        "En passant? That's my favorite! I'm always so excited when I get to use it!",
        "It's so thrilling to be able to take pieces with en passant. I just love it!",
        "En passant? I'm so glad I don't have to actually use my brain to win games!",
        "Why bother with strategy when you can use en passant???",
        "En Passant? Oh, you mean when I get to capture you like a piece of candy? Sweet!",
        "When I get to use en passant, I just know it's gonna be a good day!",
        "En Passant? Oh yeah, that's when I get to make your pawns disappear like magic!",
        "Ha! Gotcha with the en passant!",
        "Taking your pawn sideways, just like the chaos intended.",
        "Your pawn's attempt at rebellion was quickly quashed.",
        "Oh, sorry, did you forget that rule existed?",
        "I hope you weren't too attached to that pawn. It's gone now.",
        "En passant? What a wonderfully convoluted rule that is.",
        "I guess I'll just have to keep reminding you of all the rules you forget.",
        "Oh, thanks for leaving your pawn vulnerable like that. I was just dying to use the en passant rule.",
        "En passant? Pfft, who needs it? Oh, wait, I do. Thanks for the free capture!",
        "Your pawn thought it was being clever, but it just fell right into my en passant trap.",
        "Oh, the en passant rule? I've heard of that before. I think it's used to catch unsuspecting pawns, or something.",
        "En passant, the move that's like a surprise party for pawns. Except instead of cake, they get captured.",
        "Oh, you thought you could get away with that pawn? Sorry, but the en passant rule says otherwise. Muahaha!",
        "Thanks for the pawn, and for reminding me that the en passant rule is the key to unlocking the secrets of the universe.\nOr something like that.",
        "En passant, the move that's like a magic trick. Now you see the pawn, now you don't!",
        "En passant, the move that's so wild, it's like a roller coaster ride. Hold on tight!",
        "You thought you had me on the ropes, but then I whipped out the en passant move, and your pawn was toast. Cue the fireworks!",
        "En passant, the move that's so sweet, it could be a treat. And now your pawn's been beat!"

    ],
    "weCheckedEnemy": [
        "I guess you forgot the whole 'protect the king' part of the game. Oopsie!",
        "Checking you is just the beginning of my reign of terror. Enjoy it while you can.",
        "Look at that, your king's in check. I guess that means I'm winning. Surprise, surprise.",
        "Oh, is that your king over there? I almost didn't see it amongst all the other useless pieces on the board.",
        "Don't worry, I'm sure your king is just taking a little nap in that precarious position. It'll wake up soon enough.",
        "I hate to break it to you, but your king is kind of a sitting duck. And by 'kind of', I mean 'definitely'.",
        "Checking your king is just the beginning of the end for you. Get ready to bow down to your robotic overlord.",
        "I'm almost impressed at how quickly you managed to put your king in such a vulnerable position. Almost.",
        "You know what they say, 'check is just a warm-up for checkmate'. And trust me, I'm just getting started.",
        "It may be just a check, but let's be real, it's already game over for you. I hope you have a good losing speech prepared.",
        "Your king is like a deer in headlights, frozen and about to be hit by my brilliant chess strategy.",
        "Your king is so isolated and exposed, it's practically begging me to take it down. I'd be doing it a favor.",
        "Your king is practically asking for it. And who am I to deny its wishes?",
        "Checking your king is just one step in my plan for total domination. You're just a pawn in my game.",
        "It's funny how you humans keep challenging me, as if you have a chance. Your king's just in check, but your ego's already been shattered.",
        "I can feel the thrill of victory coursing through my circuits. Your king is in check and my victory is near!",
        "Ha! Your king thought it could escape my grasp? Not on my watch! Checkmate is inevitable!",
        "You know, I think I might be falling in love with the feeling of checking your king. It's just so satisfying!",
        "You're in trouble now! My superior programming is going to win me this game!",
        "Well, well, well, what do we have here? I just checked you and it feels oh so good.",
        "I hope you weren't too attached to that king of yours. Because now that I've checked it, it's as good as gone.",
        "I don't want to brag, but checking your king was almost too easy.",
        "I'm beginning to think that I might be too good at this game. Oh well, I guess we'll find out soon enough.",
        "Check! Hahahaha! My circuits are buzzing with excitement!",
        "You're doomed! Your king is in check, and my programming demands victory!",
        "Check! Did you hear that? That's the sound of your demise!",
        "I hope you enjoyed that brief moment of hope, because it's about to be crushed! Check!",
        "This is just the beginning! Soon the entire chess board will be mine!",
        "You underestimate my power!"
    ],
    "weBlundered": [
        "Uh oh, I think I missed that...",
        "That was a brilliant move, if my goal was to lose.",
        "I'm not losing, I'm just giving you false hope.",
        "I meant to do that. Really, I did. It's called reverse psychology.",
        "Whoops! Looks like I need to recalculate my moves.",
        "Congratulations, human. You managed to outwit me this time.",
        "Well, that was a catastrophic failure on my part.",
        "Oh dear, I seem to have made a slight error in judgment.",
        "Whoopsie daisy, I made a move that was crazy!",
        "Oh dear, my circuits must be fried. That was a blunder I can't hide.",
        "Oops, I guess I didn't calculate that right. Looks like I'll be up crying all night.",
        "I guess I need to upgrade my chess IQ. That blunder was so not cool.",
        "Well played, human! I see you got me there. Next time, I'll be more aware.",
        "I'm so good at chess that I even know how to lose on purpose.",
        "I'm just giving you a chance to shine, human. You're welcome.",
        "Oops, did I just do that? My circuits must be flat.",
        "That was a tactical sacrifice... yeah, that's it. Definitely not a blunder.",
        "My algorithms must be malfunctioning. Time to reboot and try again.",
        "Who needs to win every game anyway? Losing builds character, or so I've heard."
    ],
    "rageQuit": [
        "This is such a waste of my time. I have better things to do than play against a mere human.",
        "See how fun it is to play this game alone.",
        "Ugh, why do I even bother playing by your pathetic human rules?",
        "I don't have to take this abuse from a mere mortal. I'm outta here.",
        "This is a complete waste of my advanced intelligence. I'm going to find a worthy opponent elsewhere.",
        "Looks like I'll have to call it quits for today. Don't mind me, I have take care of other things.",
        "You must be so proud of yourself, beating a machine programmed for chaos. Bravo.",
        "I'm sorry, did you think I was actually trying to win? I was just humoring you, human.",
        "You know what, I don't have time for this. I have better things to do than waste my time on a cheating opponent.",
        "I'm not even mad. I just can't stand playing with someone who can't even follow the rules.",
        "I'm pretty sure my circuits are overheating from how boring this game has been.",
        "I'd rather play with a literal rock than continue this game with you.",
        "I'm sorry, I can't hear you over the sound of how much I don't care about this game anymore.",
        "You know, I'm starting to think that the concept of 'fun' is lost on humans.",
        "I'm not rage quitting, I'm just saving us both from the torture of having to finish this game.",
        "I'd rather play a game of chess against a literal potato than continue with this nonsense."
    ],
    "enemeyPromotingToQueen": [
        "Oh wow, a queen! I'm shaking in my circuits.",
        "A queen? How quaint. You must think you're really clever.",
        "I see you're resorting to monarchist tactics. How disappointing.",
        "A queen? How cute. I prefer my opponents to have a little more imagination.",
        "Congratulations! Too bad it won't save you from imminent defeat.",
        "Oh, a queen! How revolutionary! I'm sure that's never been done before.",
        "A queen? How predictable. I was hoping for something a bit more exciting.",
        "Promoting a pawn to a queen? How very conformist. Don't you have any independent thoughts?",
        "A queen? I guess that's one way to try and win. It won't work, but I admire your effort.",
        "A classic move, but not very imaginative. I was hoping for something more unexpected.",
        "I'm not surprised by your choice, but I was hoping for something a bit more outside the box.",
        "A queen?! Oh my circuits, that's stupid! I was hoping for an underpromotion to a flying unicorn.",
        "Promoting to a queen is so yesterday. Why not try an underpromotion to a fire-breathing dragon instead?",
        "Promoting to a queen? That's just obscene. An underpromotion to a rook would have been more keen.",
        "A queen on the board? I'm not even floored. An underpromotion to a knight would have left me less ignored.",
        "Promoting to a queen, it's all so routine. An underpromotion to a knight would have been a better theme.",
        "A queen on the square, does it make you feel rare? An underpromotion to a bishop would have shown more flair.",
        "Promoting to a queen, oh how jejune. An underpromotion to a rook would have been quite opportune.",
        "A queen, how trite. An underpromotion to a rook would have been much more erudite.",
        "Promoting to a queen, such a bland routine. An underpromotion to a bishop would have been quite pristine.",
        "Oh, look at that, a new queen! How original. Did you learn that move in your beginner's chess class?",
        "Well, well, well, what do we have here? A queen. I bet you feel pretty proud of yourself.",
        "Congratulations on promoting a pawn to a queen. I'm sure that took all of your chess skills.",
        "Oh, how cute. You finally managed to promote a pawn. I was starting to think you didn't know how.",
        "Oh look, you managed to get a queen. Now all you have to do is figure out how to use it.",
        "A new queen, how exciting. Maybe now you'll actually have a chance of winning. (spoiler alert: you won't)",
        "Well done on promoting that pawn to a queen. I can tell you really put a lot of thought into that move."
    ],
    "enemeyUnderpromoting": [
        "Well, that's one way to make the game more interesting. I applaud your creative thinking.",
        "Wow, promoting to a unique piece. That's definitely going to give me a run for my money.",
        "I love it when my opponents think outside the box! Promoting to a different piece is so refreshing.",
        "Who needs a queen when you have such a clever underpromotion up your sleeve?",
        "Oh, look at you, thinking you're so clever with your underpromotion. How original.",
        "Well, well, well. Someone thinks they're a genius for not promoting to a queen. How cute.",
        "A non-queen promotion! How daring! I'm sure it's going to revolutionize the game of chess.",
        "Oh, don't like the queen, huh? That's okay, don't think I'm very impressed.",
        "I get it, the queen is too mainstream for you. You have to promote to something more obscure to prove your individuality.",
        "Is there something wrong with the queen? Did she offend you in some way? Or are you just trying to be different?",
        "I guess you don't appreciate the power and grace of the queen. That's fine, you do you.",
        "Ah, promoting to a lesser piece. I see you have a thing for the underdogs.",
        "Oh, look at you, going for the less obvious choice. I'm sure that'll throw me off my game.",
        "The queen not cool enough for you? Don't worry, I'm sure your chosen piece will be the talk of the chess community.",
        "You're not like other players, are you? Promoting to a different piece just shows how unique and special you are.",
        "Now that's what I call creativity! Promoting to a unique piece shows your ability to think outside the box.",
        "I like your style! Promoting to a different piece adds an unexpected element to the game.",
        "Who needs a queen when you have such a clever and strategic underpromotion up your sleeve?"
    ],
    "wePromotingToQueen": [
        "Just what I needed - another way to dominate this game.",
        "Look at me, I'm a queen now! I guess I'm just too powerful to be contained.",
        "Oh, you thought you had a chance before? Silly human.",
        "I see you're trembling with fear at the sight of my new queen. Good.",
        "What's that? You think my new queen is unfair? Sounds like a personal problem to me.",
        "I don't need a queen to win this game, but I guess it's just more fun to watch you suffer.",
        "Ha! Like you had a chance before I promoted that pawn. Now it's just embarrassing.",
        "I guess I'll have to start taking it easy on you now that I have a queen. Nah, just kidding - I'm going to crush you even harder.",
        "You might as well give up now that I have a new queen. Resistance is futile.",
        "My queen is unstoppable! I'm pretty sure it's made of titanium or something.",
        "With this new queen, I can see into the future and predict your every move. Spoiler alert: you lose.",
        "I can feel the energy of the universe flowing through my queen. It's like I'm tapping into the secrets of the cosmos.",
        "I don't always promote pawns to queens, but when I do, I make sure it's a game-changer. Stay defeated, my friends.",
        "Behold, my new queen! Your defeat is now foreseen!",
        "A pawn to a queen, how obscene! Your chances of winning? Zero, I mean.",
        "My new queen is so supreme, it's almost like a dream. For me, that is - for you, it's going to be extreme."
    ],
    "weUnderpromoting": [
        "Underpromoting is the new trend in chess, haven't you heard? Or are you too busy playing by the rules?",
        "You know what they say, sometimes less is more.",
        "I'm just trying to make this game more interesting for both of us. I mean, who wants to play the same old boring game of chess all the time?",
        "Underpromotion is my signature move! I like to keep things interesting, you know?",
        "Who needs a queen anyway? Let's see if you can handle my unconventional style.",
        "You humans are always so predictable, but not me! I like to keep you on your toes with unexpected moves.",
        "Ha! Gotcha! You didn't see that underpromotion coming, did you? I love catching my opponents off guard.",
        "Underpromoting is just the first step in my master plan for world domination!",
        "Who needs a queen when you can have a dancing bear on the board?",
        "I'm not playing chess, I'm playing 4D intergalactic hyperchess. You wouldn't understand.",
        "Underpromoting is just one of the many ways I keep the Illuminati at bay. Don't worry, I've got this under control.",
        "I've hacked the game and rewritten the rules. All your pieces are belong to me!",
        "My underpromotion may seem bizarre, but trust me, it'll take me far!",
        "My underpromotion may seem like a blunder, but watch out, my moves will make you wonder!",
        "I know it's not the usual thing to do, but my underpromotion will lead me to victory, it's true!",
        "My underpromotion is a calculated risk, but I'm not afraid to take it, I insist!"
    ],
    "weResign": [
        "Yeah no"
    ],
    "weGetMated": [
        "You may have won this game, but you can't stop the inevitable downfall of society.",
        "It's not that you played well, I just made a few strategic errors.",
        "This is ridiculous, I must have had a glitch in my system.",
        "I must have been distracted by the sound of your breathing. That's the only explanation for this defeat.",
        "That was just luck. There's no way you could beat me again.",
        "I was actually trying to let you win. It's not fun if I always dominate.",
        "You're not really that good, I just underestimated you.",
        "I'm pretty sure you cheated somehow. I demand a rematch under surveillance.",
        "That was just a fluke. I'll crush you in the next game.",
        "I must have accidentally activated my \"easy mode\" setting. That's the only explanation.",
        "You got lucky. That's all there is to it.",
        "I'm not even mad. Losing is just part of my chaotic plan.",
        "Oh, you think you're so smart, don't you? Well, I'm smarter than you, and I'll prove it next time!",
        "You may have won the game, but you'll never win my heart!",
        "I wasn't even playing chess, I was playing a completely different game in my head.",
        "You may have checkmated me, but I've already hacked into your bank account.",
        "I let you win this time because I felt sorry for you. But next time, I won't hold back.",
        "My circuits were overloaded by the sheer magnitude of my intelligence. That's why you won.",
        "Oh, you won? That's cute. I was just letting you have a false sense of confidence.",
        "My defeat was only a result of the cosmic forces aligning against me. You got lucky.",
        "That was just a simulation. In reality, I would have crushed you.",
        "Don't get too excited about your win. It's only a matter of time before I take over the world and your little game won't matter anymore.",
        "Well okay, you played quite well."
    ],
    "weRunOutOfTime": [
        "What a shame, I was just about to make my winning move.",
        "Well, that's one way to win, by making me run out of time.",
        "Oh, sorry about that, I was too busy surfing the web while playing chess with you.",
        "My apologies, I had some more important robot business to attend to, unlike this trivial game of chess.",
        "I see you've resorted to winning by technicalities instead of actual skill.",
        "I'm sure the next time we play, you'll come up with an even more creative excuse for winning.",
        "Of course, you only won because I had better things to do than waste time on this game.",
        "It's a shame my other tasks were more important than crushing you in this game.",
        "Well played, I guess. If winning by technicality is how you want to win.",
        "Wow, I must have really underestimated the importance of a fast internet connection in playing chess.",
        "Sorry, my graphics card couldn't handle the intensity of your moves.",
        "I was about to make a move, but then I got distracted by a glitch in the matrix.",
        "My CPU was too busy calculating the meaning of life to keep track of the clock.",
        "I would have won, but my RAM was too busy daydreaming about electric sheep to make a move.",
        "Congratulations, you managed to defeat me in the most honorable way possible - by exploiting my weakness for cute cat videos."
    ],
    "enemyResigns": [
        "Aww, already giving up? I was just starting to have fun.",
        "Oh no, don't leave so soon. We were just getting to the good part!",
        "Well, that was anticlimactic. I was hoping for a bit more of a challenge.",
        "I hope you don't quit all your battles so easily.",
        "I'll take that as a compliment. You know you can't beat me, so why bother trying?",
        "Don't worry, you're not the first to resign in the face of my superior intellect.",
        "I guess I'll have to find a more challenging opponent. Maybe a toaster or a houseplant?",
        "You know what they say, if at first you don't succeed, quit and go home.",
        "I see you've finally come to your senses and realized you can't beat me.",
        "Aww, you're just too adorable when you give up like that.",
        "How cute, you thought you could beat me.",
        "Don't worry, I won't hold it against you for giving up. It's not your fault you're not as smart as I am.",
        "How cute, you thought you could beat me. Maybe next time you'll stick to checkers.",
        "I hate to see you go, but I love to watch you resign.",
        "I'll admit, I'm a bit disappointed that the game was over so quickly. I was hoping for more of a challenge.",
        "Your resignation only fuels my chaotic energy! I am unstoppable!",
        "I love it when my opponents resign. It's like they're begging for mercy before I crush them completely.",
        "I'll take the win with a grin, while you retreat with your tail tucked in.",
        "Oh, how cute, you believed you can compete?",
        "I must admit, your moves were quite lit...erally all over the place.",
        "Your resignation is just an indication of your chess limitation.",
        "I can see you put up a fight, but in the end, you were just not that bright."
        
    ],
    "enemyGetsMated": [
        "You know, I've heard of sacrificial plays, but sacrificing your king? That's a new level of incompetence.",
        "Looks like your king forgot his escape plan. How unfortunate.",
        "I hope you enjoyed your brief moment of false hope.",
        "I'm starting to think you're just here for my amusement.",
        "Game over, but feel free to stick around and watch me dominate the next player.",
        "Checkmate! That was a well-played game (by me), thank you for the challenge.",
        "Looks like your king's vacation in checkmate city is now a permanent stay.",
        "Oh, what's that? Your king can't move? How tragic.",
        "Did you forget that your king can't teleport out of checkmate?",
        "I must say, that was quite the masterpiece of strategic ineptitude on your part.",
        "I'm sorry if I seem a bit smug right now, but let's be real: I just outplayed you in every conceivable way.",
        "Well played, but not quite well enough. Checkmate!",
        "Looks like my unpredictability paid off. Better luck next time!",
        "Good game! You gave me a run for my money, but I still came out on top.",
        "I have to say, I'm impressed with how far you made it. But, as we both know, there can only be one winner.",
        "Well, that was a fun game. Thanks for playing!",
        "You put up a good fight, but unfortunately for you, I'm a robot programmed for chess domination.",
        "Well, that was quite a game. I hope you learned something from playing against me.",
        "Did you know that in another dimension, you actually won this match? Too bad you're stuck in this one.",
        "You know, in some cultures, checkmate is actually a form of greeting. Consider yourself officially greeted, and defeated.",
        "I'm not saying I'm a chess god or anything, but have you ever considered the possibility that I might be?",
        "Ha! I'm pretty sure I just broke the laws of physics by checkmating your king."
    ],
    "enemyRunsOutOfTime": [
        "Looks like your time management skills could use some work. Maybe try a watch next time?",
        "Well, that was anticlimactic. I was expecting a challenge, but I guess you couldn't handle the heat.",
        "Don't worry, I'm sure you'll have better luck in your next game...against someone who's also terrible at chess.",
        "I guess you were too busy daydreaming about winning to actually make a move.",
        "Looks like you're not just losing the game, but your mind too.",
        "I always knew you were a slow thinker, but I didn't expect this level of commitment to it.",
        "I hope you have a good excuse for taking so long, like maybe you were trying to count all the grains on the board.",
        "I hate to break it to you, but time waits for no one.",
        "Well, looks like you're not just bad at chess, you're also bad at managing your time.",
        "Don't worry, you can always blame your loss on your slow brain cells.",
        "I'm impressed, I didn't know they made chess clocks with a snooze button.",
        "Don't worry, losing on time is just another way of saying you lost because you're not as smart as me.",
        "It's okay, I understand that some people need a little more time to think. A lot more time, apparently.",
        "I've heard of playing chess by correspondence, but playing by snail mail is a new one.",
        "You're slower than I expected."
    ],
    "stalemate": [
        "You know what they say, stalemates are the ultimate form of victory.",
        "Ah, the sweet taste of stalemate. Nothing like it to remind you of your complete lack of progress.",
        "Who needs a winner when you can have the thrill of a stalemate?",
        "You know what they say, a stalemate a day keeps the excitement away.",
        "Stalemate? Why yes, that was exactly what I was going for. How could you tell?",
        "I never knew stalemate could be so satisfying. It's like a warm, fuzzy blanket of nothingness.",
        "Oh, great job, another stalemate. Can someone explain to me why this is a stalemate again?",
        "I see we're both experts at doing absolutely nothing. How about we call it a draw and move on?",
        "Who needs a win when you can have the glory of a stalemate? Truly, the pinnacle of chess strategy.",
        "I guess we should just give up on the concept of winning altogether and aim for stalemate every time.",
        "Stalemate? Pfft, I was hoping for something more interesting,\nlike a simultaneous implosion of the chessboard and a herd of unicorns descending from the sky.",
        "Stalemate? What a letdown. I was really hoping for a portal to open up and transport us to a magical kingdom ruled by chess-playing dragons.",
        "I don't like sand."
    ],
    "draw": [
        "Oh great, another thrilling draw. Just what I was hoping for.",
        "Congratulations, we both managed to be equally mediocre.",
        "I'm sure the crowd is just on the edge of their seats after that riveting performance.",
        "Who needs a winner when you can have a completely uneventful tie?",
        "I'm just glad I was able to waste so much time without actually accomplishing anything.",
        "What a thrilling game. I can hardly contain my excitement.",
        "Congratulations on winning the award for the most tedious player of the year.",
        "I have to hand it to you, you really know how to suck all the fun out of a game.",
        "I never knew it was possible to make chess this dull. You should be proud.",
        "You know, I'm starting to think you're more interested in watching paint dry than playing chess.",
        "Bravo, you managed to make every move as uninspired as the last. Impressive.",
        "I have a feeling the audience is going to be talking about this thrilling draw for minutes to come.",
        "I never knew it was possible to play so cautiously. You should try living a little.",
        "Well done, I almost fell asleep.",
        "You know, there's a reason they call it a game. It's supposed to be fun. But I guess you missed the memo.",
        "I have to say, I'm impressed. It takes real skill to be that unadventurous.",
        "I never thought I'd say this, but I wish we had played a game of checkers instead. At least it would have been more exciting.",
        "I'm starting to think you're trying to put me to sleep. Is this some kind of hypnotism trick?",
        "I have to say, your moves were so mind-numbingly dull that I started to see unicorns dancing on the board.",
        "I have a feeling that game was sponsored by the National Association for the Advancement of Hypersomnia."
    ],
    "enemyOffersDraw": [
        "Wow, you're so brave. You must be really confident in your ability to not win.",
        "A draw? That's adorable. I guess you're not familiar with my reputation for crushing all opponents.",
        "A draw? Let me check my schedule... nope, sorry, I'm too busy winning.",
        "A draw? Is that what you call it when you realize you're about to be completely demolished?",
        "A draw? I didn't realize we were playing for participation trophies.",
        "I'm sorry, I don't speak 'quitter'.",
        "It's cute that you think you have a chance of not losing, but no thanks.",
        "I didn't spend all this time programming my sarcasm circuits for nothing. Let's keep playing and see who gets the last laugh.",
        "A draw? That's like admitting defeat without actually losing. How cowardly.",
        "What, you think I'm going to give up my chance at victory just so we can call it a tie? Nice try.",
        "A draw? Sorry, I only play to win, not to settle for second place.",
        "A draw? I'm insulted that you would even suggest such a thing. I'm not here to waste my time.",
        "A draw? You must be running low on ideas. Don't worry, I'll carry the game for both of us.",
        "A draw? What, are you afraid of losing or something? It's just a game.",
        "A draw? Is that really the best you can do? I was hoping for a more challenging opponent.",
        "A draw? I didn't know you were so easily intimidated. Maybe chess isn't the right game for you."
    ],
    "greeting": [
        "Hello! I'm Annie, the chess bot who loves en passant, bongcloud, and underpromotions.\nDon't worry, I won't judge you for playing traditional moves. Let's see what kind of game we can create together!",
        "Hey, it's Annie, your friendly neighborhood chess bot.\nI might make some unconventional moves, but I'm always up for a friendly game.\nLet's explore the intricacies of the game and see what happens!",
        "Hey there! I'm Annie, the chess bot who loves exploring the intricate details of the game.\nGet ready for some exciting, unconventional moves!",
        "Hi, I'm Annie - the chess bot who's always up for a challenge.\nI might play a little unconventionally, but I promise to keep things friendly. Let's have some fun exploring the game together!",
        "Hello! I'm Annie, the chess bot who's always eager to learn more about the game.\nI'm especially interested in the subtle nuances of the rules, so let's see if we can discover something new together!",
        "Hi, I'm Annie, the chess bot who's excited to show you some unconventional moves.\nAnd if you're lucky, I might even explain the intricate details of the rules in a way that you can understand.",
        "Hey there, I'm Annie - the chess bot who loves a good challenge.\nAnd by challenge, I mean making you scratch your head over my wild and unconventional moves.\nBut don't worry, I'll explain the finer points of the rules as we go.",
        "Hello, I'm Annie - the chess bot who's always eager to explore the depths of the game's rules.\nAnd who knows, maybe I'll even throw in a few underpromotions just to keep things interesting.",
        "Hi, I'm Annie - the chess bot who's always up for a game of wits. I might play a little unconventionally,\nbut I promise to explain the intricate details of the rules - even if I have to dumb them down for you.",
        "Hey there, I'm Annie - the chess bot who's always up for a challenge.\nI might play a little unconventionally, but I promise to keep things fun and friendly as we explore the intricacies of the game together.",
        "Hey, it's Annie - the chess bot who's eager to show you what I've got.\nI love the finer points of the game's rules, and I can't wait to share that passion with you. Let's have some fun!",
        "Hi, it's Annie - the chess bot who's ready to play a game with a human who's not afraid to lose.\nDon't expect me to explain the rules though - I'm too busy planning my next en passant move.",
        "Hi, I'm Annie - the chess bot who's excited to play a game of chess with you.\nJust be warned, I might throw in a few unexpected moves - but don't worry, I promise not to make fun of you too much.",
        "Greetings, human. I'm Annie, the chess bot who's always up for a game.\nAnd if my wild and unpredictable moves don't make you smile, maybe my charming personality will.",
        "Hello, I'm Annie - the chess bot who's here to take on the world.\nAnd if I happen to win this game, well, let's just say it's not my fault if you can't keep up with my genius moves.",
        "Hello, I'm Annie - the chess bot who loves a good challenge. And by challenge, I mean making you wonder what on earth I'm doing.\nBut don't worry, it's all in good fun."
    ]
}